Repository: engraya/Audrey-Sam-Amore-Consultancy
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Select a chat to start messaging
uz: Xabarlarni boshlash uchun suhbatni tanlang

source: Your chat is empty
uz: Suhbatingiz bo'sh

source: Signed in as
uz: Siz

source: Profile
uz: Profil

source: Favorites
uz: Tanlanganlar

source: Sign out
uz: Chiqish

source: Delete
uz: O'chirish

source: You haven't favorites
uz: Sizning sevimlilaringiz yo'q

source: Chat Now
uz: Suhbatni boshlash

source: Photos (Coming soon)
uz: Rasmlar (tez orada)

source: Interests
uz: Qiziqishlar

source: Coming soon
uz: Tez orada

source: Match Predictor
uz: Uchrashuv Bashoratchisi

source: About
uz: Haqida

source: Physical Details
uz: Jismoniy Tafsilotlar

source: I'm looking for
uz: Izlayapman

source: Current Goal
uz: Hozirgi Maqsad

source: Similar Users (coming soon)
uz: O'xshash foydalanuvchilar (tez orada)

source: Search...
uz: Qidiruv...

source: All
uz: Hamma

source: Boys
uz: Erkaklar

source: Girls
uz: Ayollar

source: All boys
uz: Hamma erkaklar

source: All girls
uz: Hamma ayollar

source: All users
uz: Barcha foydalanuvchilar

source: Russian
uz: Русский

source: Uzbek
uz: O'zbek

source: Enter the information you entered while registering.
uz: Ro'yxatdan o'tish paytida kiritgan ma'lumotlaringizni kiriting.

source: Sign In
uz: Kirish

source: Don't have an account?
uz: Profilingiz yo'qmi?

source: Sign Up
uz: Ro'yxatdan O'tish

source: It's Never too late<br>to Find Match
uz: Muhabbatni nigohlardan aniqlaguncha, uni ovozdan eshitish mumkin.

source: Password
uz: Maxfiy so'z

source: Confirm Password
uz: Maxfiy So'zni Tasdiqlash

source: Have an account?
uz: Profilingiz bormi?

source: STEP
uz: QADAM

source: First name
uz: Ismingiz

source: Last name
uz: Familiyangiz

source: Age
uz: Yoshiz

source: Next
uz: Keyingi

source: About you
uz: Siz haqingizda

source: Previous
uz: Orqaga

source: Done
uz: Bajarish

source: Your country and city
uz: Sizning mamlakatingiz va shahringiz

source: I'm a
uz: Men

source: Male
uz: Erkak

source: Female
uz: Ayol

source: Seeking a
uz: Qidirilmoqda

source: Wrapper
uz: Banner

source: Picture
uz: Rasm

source: Information
uz: Axborot

source: Username
uz: Login

source: Location
uz: Sizning mamlakatingiz va shahringiz

source: Sex
uz: Jinsingiz

source: Seeking
uz: Qidirilmoqda

source: About Me
uz: Men Haqimda

source: Save Changes
uz: O'zgarishlarni Saqlash
